export const HISTORICAL_DATES_MOCK = [
  {
    id: 1,
    category: 'Кино',
    events: [
      {
        id: 1,
        year: 1895,
        description:
          "Братья Люмьер провели первый публичный киносеанс в Париже, показав фильм 'Прибытие поезда на вокзал Ла-Сьота'",
      },
      {
        id: 2,
        year: 1927,
        description:
          "Вышел первый звуковой полнометражный фильм 'Певец джаза', ознаменовавший конец эры немого кино",
      },
      {
        id: 3,
        year: 1939,
        description:
          "Премьера фильма 'Унесённые ветром' в Атланте, который стал одним из самых кассовых фильмов в истории",
      },
      {
        id: 4,
        year: 1975,
        description:
          "Премьера фильма 'Челюсти' Стивена Спилберга, положившего начало эре летних блокбастеров",
      },
      {
        id: 5,
        year: 1977,
        description:
          "Выход 'Звездных войн' Джорджа Лукаса, революционизировавшего индустрию спецэффектов",
      },
      {
        id: 6,
        year: 1994,
        description:
          "Премьера фильма 'Побег из Шоушенка', впоследствии возглавившего рейтинг IMDb",
      },
      {
        id: 7,
        year: 2001,
        description:
          "Первая часть трилогии 'Властелин колец: Братство кольца' вышла в прокат",
      },
      {
        id: 8,
        year: 2009,
        description:
          "Премьера фильма 'Аватар' Джеймса Кэмерона, ставшего самым кассовым фильмом на тот момент",
      },
    ],
  },
  {
    id: 2,
    category: 'Литература',
    events: [
      {
        id: 9,
        year: 1605,
        description:
          "Мигель де Сервантес опубликовал первую часть романа 'Дон Кихот'",
      },
      {
        id: 10,
        year: 1813,
        description:
          "Джейн Остин опубликовала роман 'Гордость и предубеждение'",
      },
      {
        id: 11,
        year: 1818,
        description:
          "Мэри Шелли опубликовала роман 'Франкенштейн, или Современный Прометей'",
      },
      {
        id: 12,
        year: 1865,
        description: "Льюис Кэрролл опубликовал 'Алису в Стране чудес'",
      },
      {
        id: 13,
        year: 1869,
        description: "Лев Толстой завершил публикацию романа 'Война и мир'",
      },
      {
        id: 14,
        year: 1925,
        description: "Фрэнсис Скотт Фицджеральд опубликовал 'Великого Гэтсби'",
      },
      {
        id: 15,
        year: 1949,
        description: "Джордж Оруэлл опубликовал антиутопию '1984'",
      },
      {
        id: 16,
        year: 1954,
        description: "Дж.Р.Р. Толкин опубликовал первый том 'Властелина колец'",
      },
      {
        id: 17,
        year: 1997,
        description:
          "Дж.К. Роулинг опубликовала первую книгу о Гарри Поттере 'Философский камень'",
      },
    ],
  },
  {
    id: 3,
    category: 'Наука',
    events: [
      {
        id: 18,
        year: 1543,
        description:
          "Николай Коперник опубликовал труд 'О вращении небесных сфер', предложив гелиоцентрическую модель мира",
      },
      {
        id: 19,
        year: 1687,
        description:
          "Исаак Ньютон опубликовал 'Математические начала натуральной философии' с законами движения",
      },
      {
        id: 20,
        year: 1859,
        description:
          "Чарльз Дарвин опубликовал 'Происхождение видов', представив теорию эволюции",
      },
      {
        id: 21,
        year: 1879,
        description: 'Томас Эдисон изобрел практичную лампу накаливания',
      },
      {
        id: 22,
        year: 1905,
        description:
          'Альберт Эйнштейн опубликовал специальную теорию относительности',
      },
      {
        id: 23,
        year: 1928,
        description: 'Александр Флеминг открыл пенициллин, первый антибиотик',
      },
      {
        id: 24,
        year: 1953,
        description: 'Джеймс Уотсон и Фрэнсис Крик открыли структуру ДНК',
      },
      {
        id: 25,
        year: 1969,
        description:
          'Нил Армстронг и Базз Олдрин высадились на Луне в рамках миссии Аполлон-11',
      },
      {
        id: 26,
        year: 1990,
        description: 'Запуск космического телескопа Хаббл',
      },
      {
        id: 27,
        year: 2012,
        description:
          'Открытие бозона Хиггса в ЦЕРН подтвердило Стандартную модель физики',
      },
    ],
  },
  {
    id: 4,
    category: 'Технологии',
    events: [
      {
        id: 28,
        year: 1876,
        description:
          'Александр Грэм Белл получил патент на изобретение телефона',
      },
      {
        id: 29,
        year: 1895,
        description:
          'Гульельмо Маркони провел первую успешную передачу радиосигнала',
      },
      {
        id: 30,
        year: 1946,
        description:
          'Представлен ENIAC, первый электронный программируемый компьютер общего назначения',
      },
      {
        id: 31,
        year: 1969,
        description:
          'Отправлено первое сообщение по сети ARPANET, прародителю интернета',
      },
      {
        id: 32,
        year: 1971,
        description: 'Отправлено первое электронное письмо через сеть ARPANET',
      },
      {
        id: 33,
        year: 1981,
        description: 'IBM выпустила первый персональный компьютер IBM PC',
      },
      {
        id: 34,
        year: 1991,
        description:
          'Тим Бернерс-Ли запустил первый веб-сайт, положив начало Всемирной паутине',
      },
      {
        id: 35,
        year: 2007,
        description:
          'Стив Джобс представил первый iPhone, революционизировавший рынок смартфонов',
      },
      {
        id: 36,
        year: 2009,
        description:
          'Создание криптовалюты Bitcoin, первой децентрализованной цифровой валюты',
      },
    ],
  },
  {
    id: 5,
    category: 'Музыка',
    events: [
      {
        id: 37,
        year: 1770,
        description:
          'Родился Людвиг ван Бетховен, один из величайших композиторов в истории',
      },
      {
        id: 38,
        year: 1877,
        description:
          'Томас Эдисон изобрел фонограф, первое устройство для записи и воспроизведения звука',
      },
      {
        id: 39,
        year: 1958,
        description:
          'Элвис Пресли был призван в армию США на пике своей карьеры',
      },
      {
        id: 40,
        year: 1964,
        description:
          "The Beatles появились на шоу Эда Салливана, положив начало 'британскому вторжению' в США",
      },
      {
        id: 41,
        year: 1969,
        description:
          'Музыкальный фестиваль Вудсток собрал более 400 000 человек',
      },
      {
        id: 42,
        year: 1982,
        description:
          "Выход альбома 'Thriller' Майкла Джексона, ставшего самым продаваемым в истории",
      },
      {
        id: 43,
        year: 2003,
        description:
          'Apple запустила iTunes Store, революционизировав способ покупки музыки',
      },
    ],
  },
  {
    id: 6,
    category: 'Спорт',
    events: [
      {
        id: 44,
        year: 1896,
        description: 'Проведены первые современные Олимпийские игры в Афинах',
      },
      {
        id: 45,
        year: 1930,
        description: 'Проведен первый чемпионат мира по футболу в Уругвае',
      },
      {
        id: 46,
        year: 1954,
        description:
          'Роджер Баннистер первым пробежал милю менее чем за 4 минуты',
      },
      {
        id: 47,
        year: 1980,
        description:
          'Сборная СССР по хоккею одержала победу на Олимпийских играх в Лейк-Плэсиде',
      },
      {
        id: 48,
        year: 1992,
        description:
          'Команда Dream Team США доминировала на Олимпийских играх в Барселоне',
      },
      {
        id: 49,
        year: 2008,
        description:
          'Усэйн Болт установил мировой рекорд на дистанции 100 метров на Олимпиаде в Пекине',
      },
    ],
  },
];

export interface TimeLineEvent {
  id: number;
  year: number;
  description: string;
}

export interface TimeLinePoint {
  id: number;
  category: string;
  events: TimeLineEvent[];
}

export interface HistoricalDate {
  meta: {
    pointCount: number;
  };
  data: TimeLinePoint[];
}

export const getHistoricalDates = (): HistoricalDate => {
  return {
    meta: {
      pointCount: HISTORICAL_DATES_MOCK.length,
    },
    data: HISTORICAL_DATES_MOCK,
  };
};
